; domain
(define (domain manito)
    (:requirements :strips)

    (:predicates 
        (en ?bloque ?donde)
        (pos ?garra ?donde)

        (libre ?quien)
        (apilado ?bloque)
        (dismover ?garra)
        (pinned ?garra)

        (torre ?debajo ?sobre)

        (pisog ?garra ?altura)
        (pisob ?bloque ?altura)

        (ocupado ?garra)
        (desocupado ?garra)
        
        (camino ?donde ?hasta)
        (alt ?al1 ?al2))


    (:action movehorizontal
        :parameters (?garra ?donde ?hasta)
        :precondition (and
            (pos ?garra ?donde)
            (camino ?donde ?hasta)
            (dismover ?garra)
        )
        :effect (and
            (pos ?garra ?hasta)
            (not (pos ?garra ?donde))
        )
    )

    (:action moverarriba
        :parameters (?garra ?alt ?alt2)
        :precondition (and
            (pisog ?garra ?alt)
            (alt ?alt ?alt2)
            (pinned ?garra)
        )
        :effect (and
            (pisog ?garra ?alt2)
            (not (pisog ?garra ?alt))
            (not (pinned ?garra))
            (dismover ?garra)
        )
    )

     (:action moverabajo
        :parameters (?garra ?alt ?alt2)
        :precondition (and
            (pisog ?garra ?alt)
            (alt ?alt ?alt2)
            (dismover ?garra)
        )
        :effect (and
            (pisog ?garra ?alt2)
            (not (pisog ?garra ?alt))
            (not (dismover ?garra))
            (pinned ?garra)
        )
    )

    (:action tomar
        :parameters (?garra ?bloque ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?donde)
            (pisog ?garra ?alt)
            (pisob ?bloque ?alt)
            (desocupado ?garra)
            (libre ?bloque)
        )
        :effect (and
            (ocupado ?garra)
            (not (desocupado ?garra))
            (en ?bloque ?garra)
            (not (en ?bloque ?donde))
            (not (pisob ?bloque ?alt))
            (libre ?donde)
            (libre ?bloque)
        )
    )

    (:action soltar 
        :parameters (?garra ?bloque ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?garra)
            (pisog ?garra ?alt)
            (ocupado ?garra)
            (libre ?donde)
        )
        :effect (and
            (not (ocupado ?garra))
            (desocupado ?garra)
            (not (en ?bloque ?garra))
            (en ?bloque ?donde)
            (pisob ?bloque ?alt)
            (not (libre ?donde))
        )
    )

    
    (:action desapilar
        :parameters (?garra ?bloque ?donde ?alt ?bloque2)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?donde)
            (en ?bloque2 ?donde)

            (pisog ?garra ?alt)
            (pisob ?bloque ?alt)
            (pisob ?bloque2 ?alt)
            
            (desocupado ?garra)

            (libre ?bloque)
            (apilado ?bloque2)
            (torre ?bloque2 ?bloque)
            )
            
            :effect (and
            (not (torre ?bloque2 ?bloque))
            (not (libre ?bloque))
            (not (apilado ?bloque2))
            (libre ?bloque2)
            (ocupado ?garra)
            (not (desocupado ?garra))
            (en ?bloque ?garra)
            (not (en ?bloque ?donde))
            (not (pisob ?bloque ?alt))
            )
    )

    (:action apilar
        :parameters (?garra ?bloque ?bloque2 ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?garra)
            (en ?bloque2 ?donde)

            (pisog ?garra ?alt)
            (pisob ?bloque2 ?alt)
            
            (ocupado ?garra)
            (libre ?bloque2)
            )
            
            :effect (and
            (torre ?bloque2 ?bloque)
            (libre ?bloque)
            (apilado ?bloque2)
            (not (libre ?bloque2))
            (not (ocupado ?garra))
            (desocupado ?garra)
            (not (en ?bloque ?garra))
            (en ?bloque ?donde)
            (pisob ?bloque ?alt)
            )
    )
)

; problem
(define (problem goal-green-red-blue)
    (:domain manito)

    (:objects
        redb whiteb
        garra
        xygarra xywhite xydisp1
        zgarra zwhite zdisp1
    )

    (:init
        (en whiteb xywhite)
        (pisob whiteb zwhite)
        (apilado whiteb)

        (en redb xywhite)
        (pisob redb zwhite)
        (libre redb)
        (torre whiteb redb)
        
        (pos garra xygarra)
        (pisog garra zgarra)
        (dismover garra)
        (desocupado garra)

        (libre xydisp1)

        (camino xygarra xywhite)
        (camino xywhite xygarra)
        
        (camino xygarra xydisp1)
        (camino xydisp1 xygarra)
        
        (camino xywhite xydisp1)
        (camino xydisp1 xywhite)

        (alt zgarra zwhite)
        (alt zwhite zgarra)

        (alt zgarra zdisp1)
        (alt zdisp1 zgarra)
    )

    (:goal 
        (and 
            (libre whiteb)
            (en redb xydisp1)
        )
    )
)

; plan
1. (movehorizontal garra xygarra xywhite)
   deleted: (pos garra xygarra)
   added: (pos garra xywhite)
   goals met: 0 of 2
2. (moverabajo garra zgarra zwhite)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zwhite) (pinned garra)
   goals met: 0 of 2
3. (desapilar garra redb xywhite zwhite whiteb)
   deleted: (torre whiteb redb) (libre redb) (apilado whiteb) (desocupado garra) (en redb xywhite) (pisob redb zwhite)
   added: (libre whiteb) (ocupado garra) (en redb garra)
   goals met: 1 of 2
4. (moverarriba garra zwhite zgarra)
   deleted: (pisog garra zwhite) (pinned garra)
   added: (pisog garra zgarra) (dismover garra)
   goals met: 1 of 2
5. (movehorizontal garra xywhite xydisp1)
   deleted: (pos garra xywhite)
   added: (pos garra xydisp1)
   goals met: 1 of 2
6. (soltar garra redb xydisp1 zgarra)
   deleted: (ocupado garra) (en redb garra) (libre xydisp1)
   added: (desocupado garra) (en redb xydisp1) (pisob redb zgarra)
   goals met: 2 of 2
